Revit 2027 API
StructuralMaterialTypeFilter(StructuralMaterialType) Constructor
 Constructs a new instance of a filter to match family instances that have the given structural material type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType
)
Public Sub New (
	structuralMaterialType As StructuralMaterialType
)
public:
StructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType
)
new :
        structuralMaterialType : StructuralMaterialType -> StructuralMaterialTypeFilter
Parameters
structuralMaterialType StructuralMaterialType
 The structural material type to match.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralMaterialTypeFilter Class
StructuralMaterialTypeFilter Overload
Autodesk.Revit.DB.Structure Namespace